In [8]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101)
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
print(df)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:

df = pd.DataFrame({'col1': [1,2,3,4],
                   'col2': [444,555,666,444],
                   'col3': ['abc','dfr','erh','wef']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  dfr
2     3   666  erh
3     4   444  wef

In [36]:
df1 = df[df['col1']>2]

In [37]:
df1

   col1  col2 col3
2     3   666  erh
3     4   444  wef

In [38]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  dfr
2     3   666  erh
3     4   444  wef

In [50]:
df['col3'] = pd.cut(df.col2, bins=[0,400,500,600,800], labels=[1,2,3,4])

In [51]:
df

   col1  col2 col3
0     1   444    2
1     2   555    3
2     3   666    4
3     4   444    2

In [52]:
df = pd.ones(2,3)

AttributeError: module 'pandas' has no attribute 'ones'